.planning/case_profiles/case_028_v2_apu_bay_ventilation_dicts/0/p
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object p; }

// case_028 v2 (V65-A B77) ventilation · kinematic pressure (Pa / rho)
// v2 change vs v1: 4 lateral walls slip → zeroGradient (wall-consistent · no flux through)
// outlet fixed reference p=0 · all wall surfaces zeroGradient

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bay_top
    {
        type            zeroGradient;
    }
    bay_bottom
    {
        type            zeroGradient;
    }
    bay_side_p
    {
        type            zeroGradient;
    }
    bay_side_n
    {
        type            zeroGradient;
    }
    "(Outer_Surf|Inner_Surf|Plane_Outer_Surf|intake_duct|vent_door|door|plenum|exhaust_pipe_1|exhaust_section|bleed_air_pipe|ejector|gearbox_.*|compressor|load_compressor|load_volute|combustion_chamber|fuel_valve|firewall_.*|Frame_.*|beam_.*)"
    {
        type            zeroGradient;
    }
}
