.planning/case_profiles/case_028_v2_apu_bay_ventilation_dicts/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }

// case_028 simpleFoam kOmegaSST RAS · stable 1st-2nd-order schemes
// Industrial config · upwind for turbulence + limited central for U + Gauss linear for p

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwindV grad(U);
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
